<?php


/*
|--------------------------------------------------------------------------
| stdClass 参照先 https://readouble.com/laravel/8.x/ja/collections.html
|--------------------------------------------------------------------------
| Classを作らなくても初期で作成できているもの
|
*/



/******************************************
 *
 * 利用可能なメソッド
 * ※ありすぎるので確認してください
 * all
 * average
 * avg
 * chunk
 ******************************************/
/*
|--------------------------------------------------------------------------
| メソッド一覧
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * all()
 * allメソッドはコレクションの裏の配列表現を返します。
 *
 ******************************************/



collect([1, 2, 3])->all();

// [1, 2, 3]


/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * chunk()
 * chunkメソッドはコレクションを指定したサイズで複数の小さなコレクションに分割します。

 *
 ******************************************/

$collection = collect([1, 2, 3, 4, 5, 6, 7]);

$chunks = $collection->chunk(4);

$chunks->all();

// [[1, 2, 3, 4], [5, 6, 7]]

/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * concat()
 * concatメソッドは、指定したarrayまたはコレクションの値を別のコレクションの最後に追加します。
 *
 ******************************************/


$collection = collect(['John Doe']);

$concatenated = $collection->concat(['Jane Doe'])->concat(['name' => 'Johnny Doe']);

$concatenated->all();

// ['John Doe', 'Jane Doe', 'Johnny Doe']


/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * count()
 * countメソッドはコレクションのアイテム数を返します。
 *
 ******************************************/




$collection = collect([1, 2, 3, 4]);

$collection->count();

// 4

/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * dd()
 *  ddメソッドはコレクションアイテムをダンプし、スクリプトの実行を停止します。
 *
 ******************************************/




$collection = collect(['John Doe', 'Jane Doe']);

$collection->dd();

/*
    Collection {
        #items: array:2 [
            0 => "John Doe"
            1 => "Jane Doe"
        ]
    }
*/

/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * diff()
 * diffメソッドはコレクションと、他のコレクションか一次元「配列」を値にもとづき比較します。
 * このメソッドは指定されたコレクションに存在しない、オリジナルのコレクションの値を返します。

 *
 ******************************************/


$collection = collect([1, 2, 3, 4, 5]);

$diff = $collection->diff([2, 4, 6, 8]);

$diff->all();

// [1, 3, 5]


/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * except()
 *
 * exceptメソッドは、キーにより指定したアイテム以外の全コレクション要素を返します。
 *
 *
 * ※よく使うので覚えておきましょう。
 * exceptの正反対の機能は、onlyメソッドです。
 *
 ******************************************/



$collection = collect(['product_id' => 1, 'price' => 100, 'discount' => false]);

$filtered = $collection->except(['price', 'discount']);

$filtered->all();

// ['product_id' => 1]


/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * first()
 * firstメソッドは指定された真偽テストをパスしたコレクションの最初の要素を返します。
 *
 ******************************************/




collect([1, 2, 3, 4])->first(function ($value, $key) {
    return $value > 2;
});

// 3
firstメソッドに引数を付けなければ、コレクションの最初の要素を取得できます。コレクションが空ならnullを返します。

collect([1, 2, 3, 4])->first();

// 1
/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * get()
 *
 * getメソッドは指定されたキーのアイテムを返します。
 *
 * ※ここも大事です。
 * キーが存在していない場合はnullを返します。
 *
 ******************************************/



$collection = collect(['name' => 'taylor', 'framework' => 'laravel']);

$value = $collection->get('name');

// taylor

オプションとして第２引数にデフォルト値を指定することもできます。

$collection = collect(['name' => 'taylor', 'framework' => 'laravel']);

$value = $collection->get('age', 34);

// 34
メソッドのデフォルト値としてコールバックを渡すこともできます。
指定したキーが存在しない場合、コールバックの結果が返されます。

$collection->get('email', function () {
    return 'taylor@example.com';
});

// taylor@example.com

/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * groupBy()
 * groupByメソッドは指定したキーによりコレクションのアイテムをグループにまとめます。
 *
 ******************************************/



$collection = collect([
    ['account_id' => 'account-x10', 'product' => 'Chair'],
    ['account_id' => 'account-x10', 'product' => 'Bookcase'],
    ['account_id' => 'account-x11', 'product' => 'Desk'],
]);

$grouped = $collection->groupBy('account_id');

$grouped->all();

/*
    [
        'account-x10' => [
            ['account_id' => 'account-x10', 'product' => 'Chair'],
            ['account_id' => 'account-x10', 'product' => 'Bookcase'],
        ],
        'account-x11' => [
            ['account_id' => 'account-x11', 'product' => 'Desk'],
        ],
    ]
*/
文字列でkeyを指定する代わりに、コールバックを渡すことができます。コールバックはグループとしてまとめるキーの値を返す必要があります。

$grouped = $collection->groupBy(function ($item, $key) {
    return substr($item['account_id'], -3);
});

$grouped->all();

/*
    [
        'x10' => [
            ['account_id' => 'account-x10', 'product' => 'Chair'],
            ['account_id' => 'account-x10', 'product' => 'Bookcase'],
        ],
        'x11' => [
            ['account_id' => 'account-x11', 'product' => 'Desk'],
        ],
    ]
*/
配列として、複数のグルーピング基準を指定できます。各配列要素は多次元配列の対応するレベルへ適用されます。

$data = new Collection([
    10 => ['user' => 1, 'skill' => 1, 'roles' => ['Role_1', 'Role_3']],
    20 => ['user' => 2, 'skill' => 1, 'roles' => ['Role_1', 'Role_2']],
    30 => ['user' => 3, 'skill' => 2, 'roles' => ['Role_1']],
    40 => ['user' => 4, 'skill' => 2, 'roles' => ['Role_2']],
]);

$result = $data->groupBy(['skill', function ($item) {
    return $item['roles'];
}], $preserveKeys = true);

/*
[
    1 => [
        'Role_1' => [
            10 => ['user' => 1, 'skill' => 1, 'roles' => ['Role_1', 'Role_3']],
            20 => ['user' => 2, 'skill' => 1, 'roles' => ['Role_1', 'Role_2']],
        ],
        'Role_2' => [
            20 => ['user' => 2, 'skill' => 1, 'roles' => ['Role_1', 'Role_2']],
        ],
        'Role_3' => [
            10 => ['user' => 1, 'skill' => 1, 'roles' => ['Role_1', 'Role_3']],
        ],
    ],
    2 => [
        'Role_1' => [
            30 => ['user' => 3, 'skill' => 2, 'roles' => ['Role_1']],
        ],
        'Role_2' => [
            40 => ['user' => 4, 'skill' => 2, 'roles' => ['Role_2']],
        ],
    ],
];
*/

/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * メソッド定義
 *
 ******************************************/


isEmpty()
isEmptyメソッドはコレクションが空の場合にtrueを返します。そうでなければfalseを返します。

collect([])->isEmpty();

// true
isNotEmpty()
isNotEmptyメソッドは、コレクションが空でない場合にtrueを返します。空であればfalseを返します。

collect([])->isNotEmpty();

// false

/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * join()
 * joinメソッドは、コレクションの値を文字列で結合します。
 *
 * このメソッドの２番目の引数を使用して、最後の要素を文字列に追加する方法を指定することもできます。

 *
 ******************************************/

collect(['a', 'b', 'c'])->join(', '); // 'a, b, c'
collect(['a', 'b', 'c'])->join(', ', ', and '); // 'a, b, and c'
collect(['a', 'b'])->join(', ', ' and '); // 'a and b'
collect(['a'])->join(', ', ' and '); // 'a'
collect([])->join(', ', ' and '); // ''


/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * pluck()
 *
 * pluckメソッドは指定したキーの全コレクション値を取得します。
 *
 ******************************************/


$collection = collect([
    ['product_id' => 'prod-100', 'name' => 'Desk'],
    ['product_id' => 'prod-200', 'name' => 'Chair'],
]);

$plucked = $collection->pluck('name');

$plucked->all();

// ['Desk', 'Chair']


/******************************************
 * pluck()
 *
 * コレクションのキー項目も指定できます。
 * これはよく使うので覚えておきましょう。
 ******************************************/
さらに、

$plucked = $collection->pluck('name', 'product_id');

$plucked->all();

// ['prod-100' => 'Desk', 'prod-200' => 'Chair']
pluckメソッドは、「ドット」記法を使ったネストしている値の取得もサポートしています。

$collection = collect([
    [
        'speakers' => [
            'first_day' => ['Rosa', 'Judith'],
            'second_day' => ['Angela', 'Kathleen'],
        ],
    ],
]);

$plucked = $collection->pluck('speakers.first_day');

$plucked->all();

// ['Rosa', 'Judith']
重複するキーが存在している場合は、最後に一致した要素が結果のコレクションへ挿入されます。

$collection = collect([
    ['brand' => 'Tesla',  'color' => 'red'],
    ['brand' => 'Pagani', 'color' => 'white'],
    ['brand' => 'Tesla',  'color' => 'black'],
    ['brand' => 'Pagani', 'color' => 'orange'],
]);

$plucked = $collection->pluck('color', 'brand');

$plucked->all();

// ['Tesla' => 'black', 'Pagani' => 'orange']

/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * push()
 * pushメソッドはコレクションの最後にアイテムを追加します。
 *
 * これもまぁまぁ利用するので覚えておくと良いです。
 ******************************************/



$collection = collect([1, 2, 3, 4]);

$collection->push(5);

$collection->all();

// [1, 2, 3, 4, 5]

/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * put()
 * putメソッドは指定したキーと値をコレクションにセットします。
 *　pushと違い、キーと値、どちらも入ります。
 ******************************************/




$collection = collect(['product_id' => 1, 'name' => 'Desk']);

$collection->put('price', 100);

$collection->all();

// ['product_id' => 1, 'name' => 'Desk', 'price' => 100]
/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * sortBy()
 * sortByメソッドは指定したキーでコレクションをソートします。
 * ソート済みコレクションはオリジナル配列のキーを保持します。
 *
 * 以下の例では、valuesメソッドにより、連続した数字のインデックスにするためリセットしています。

 *
 ******************************************/


$collection = collect([
    ['name' => 'Desk', 'price' => 200],
    ['name' => 'Chair', 'price' => 100],
    ['name' => 'Bookcase', 'price' => 150],
]);

$sorted = $collection->sortBy('price');

$sorted->values()->all();

/*
    [
        ['name' => 'Chair', 'price' => 100],
        ['name' => 'Bookcase', 'price' => 150],
        ['name' => 'Desk', 'price' => 200],
    ]
*/
sortメソッドは第２引数に、ソートフラグを受け取ります。

$collection = collect([
    ['title' => 'Item 1'],
    ['title' => 'Item 12'],
    ['title' => 'Item 3'],
]);

$sorted = $collection->sortBy('title', SORT_NATURAL);

$sorted->values()->all();

/*
    [
        ['title' => 'Item 1'],
        ['title' => 'Item 3'],
        ['title' => 'Item 12'],
    ]
*/
または、独自のクロージャを渡して、コレクションの値を並べ替える方法を決定することもできます。

$collection = collect([
    ['name' => 'Desk', 'colors' => ['Black', 'Mahogany']],
    ['name' => 'Chair', 'colors' => ['Black']],
    ['name' => 'Bookcase', 'colors' => ['Red', 'Beige', 'Brown']],
]);

$sorted = $collection->sortBy(function ($product, $key) {
    return count($product['colors']);
});

$sorted->values()->all();

/*
    [
        ['name' => 'Chair', 'colors' => ['Black']],
        ['name' => 'Desk', 'colors' => ['Black', 'Mahogany']],
        ['name' => 'Bookcase', 'colors' => ['Red', 'Beige', 'Brown']],
    ]
*/
コレクションを複数の属性で並べ替える場合は、並べ替え操作の配列を sortByメソッドに渡すことができます。各並べ替え操作は、並べ替える属性と目的の並べ替えの方向で構成される配列です。

$collection = collect([
    ['name' => 'Taylor Otwell', 'age' => 34],
    ['name' => 'Abigail Otwell', 'age' => 30],
    ['name' => 'Taylor Otwell', 'age' => 36],
    ['name' => 'Abigail Otwell', 'age' => 32],
]);

$sorted = $collection->sortBy([
    ['name', 'asc'],
    ['age', 'desc'],
]);

$sorted->values()->all();

/*
    [
        ['name' => 'Abigail Otwell', 'age' => 32],
        ['name' => 'Abigail Otwell', 'age' => 30],
        ['name' => 'Taylor Otwell', 'age' => 36],
        ['name' => 'Taylor Otwell', 'age' => 34],
    ]
*/
コレクションを複数の属性で並べ替える場合、各並べ替え操作を定義するクロージャを指定することもできます。

$collection = collect([
    ['name' => 'Taylor Otwell', 'age' => 34],
    ['name' => 'Abigail Otwell', 'age' => 30],
    ['name' => 'Taylor Otwell', 'age' => 36],
    ['name' => 'Abigail Otwell', 'age' => 32],
]);

$sorted = $collection->sortBy([
    fn ($a, $b) => $a['name'] <=> $b['name'],
    fn ($a, $b) => $b['age'] <=> $a['age'],
]);

$sorted->values()->all();

/*
    [
        ['name' => 'Abigail Otwell', 'age' => 32],
        ['name' => 'Abigail Otwell', 'age' => 30],
        ['name' => 'Taylor Otwell', 'age' => 36],
        ['name' => 'Taylor Otwell', 'age' => 34],
    ]
*/
/******************************************
 * sortByDesc()
 * このメソッドの使い方はsortByと同じで、コレクションを逆順にソートします。
 *
 * sortDesc()
 * このメソッドはsortメソッドの逆順でコレクションをソートします。
 *
 ******************************************/


$collection = collect([5, 3, 1, 2, 4]);

$sorted = $collection->sortDesc();

$sorted->values()->all();

// [5, 4, 3, 2, 1]
sortとは異なり、sortDescにクロージャを渡すことはできません。代わりに、sortメソッドを使用して、比較を逆にする必要があります。


sortKeys()
sortKeysメソッドは、内部の連想配列のキーにより、コレクションをソートします。

$collection = collect([
    'id' => 22345,
    'first' => 'John',
    'last' => 'Doe',
]);

$sorted = $collection->sortKeys();

$sorted->all();

/*
    [
        'first' => 'John',
        'id' => 22345,
        'last' => 'Doe',
    ]
*/
sortKeysDesc()
このメソッドは、sortKeysメソッドと使い方は同じですが、逆順にコレクションをソートします。



/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * sum()
 * sumメソッドはコレクションの全アイテムの合計を返します。
 *
 ******************************************/


collect([1, 2, 3, 4, 5])->sum();

// 15
コレクションがネストした配列やオブジェクトを含んでいる場合、どの値を合計するのを決めるためにキーを指定してください。

$collection = collect([
    ['name' => 'JavaScript: The Good Parts', 'pages' => 176],
    ['name' => 'JavaScript: The Definitive Guide', 'pages' => 1096],
]);

$collection->sum('pages');

// 1272
さらに、コレクションのどの項目を合計するのかを決めるためにクロージャを渡すこともできます。

$collection = collect([
    ['name' => 'Chair', 'colors' => ['Black']],
    ['name' => 'Desk', 'colors' => ['Black', 'Mahogany']],
    ['name' => 'Bookcase', 'colors' => ['Red', 'Beige', 'Brown']],
]);

$collection->sum(function ($product) {
    return count($product['colors']);
});

// 6



/*

|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * take()
 * takeメソッドは指定したアイテム数の新しいコレクションを返します。
 *
 * 最初から何個かを取るってことで、シーダーで使ってました。
 * これもよく使うので覚えておいてね。
 ******************************************/



$collection = collect([0, 1, 2, 3, 4, 5]);

$chunk = $collection->take(3);

$chunk->all();

// [0, 1, 2]


// アイテム数に負の整数を指定した場合はコレクションの最後から取得します。
// マイナスを使えば後ろからとることができます。

$collection = collect([0, 1, 2, 3, 4, 5]);

$chunk = $collection->take(-2);

$chunk->all();

// [4, 5]

/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * toArray()
 * toArrayメソッドはコレクションをPHPの「配列」へ変換します。
 *
 *
 *
 * コレクションの値がEloquentモデルの場合は、そのモデルが配列に変換されます。
 * よく使います。
 * Note: toArrayは、ネストしたArrayableインスタンスのオブジェクトすべてを配列へ変換します。
 * コレクションの裏の素の配列をそのまま取得したい場合は、代わりにallメソッドを使用してください。
 ******************************************/


$collection = collect(['name' => 'Desk', 'price' => 200]);

$collection->toArray();

/*
    [
        ['name' => 'Desk', 'price' => 200],
    ]
*/


/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * where()
 * whereメソッドは指定したキー／値ペアでコレクションをフィルタリングします。
 *
 * whereメソッドはアイテム値の確認を「緩く」比較します。
 * つまり、同じ値の文字列と整数値は、同値と判断します。
 *
 ******************************************/

$collection = collect([
    ['product' => 'Desk', 'price' => 200],
    ['product' => 'Chair', 'price' => 100],
    ['product' => 'Bookcase', 'price' => 150],
    ['product' => 'Door', 'price' => 100],
]);

$filtered = $collection->where('price', 100);

$filtered->all();

/*
    [
        ['product' => 'Chair', 'price' => 100],
        ['product' => 'Door', 'price' => 100],
    ]
*/




第２引数に比較演算子をオプションとして渡すこともできます。

$collection = collect([
    ['name' => 'Jim', 'deleted_at' => '2019-01-01 00:00:00'],
    ['name' => 'Sally', 'deleted_at' => '2019-01-02 00:00:00'],
    ['name' => 'Sue', 'deleted_at' => null],
]);

$filtered = $collection->where('deleted_at', '!=', null);

$filtered->all();

/*
    [
        ['name' => 'Jim', 'deleted_at' => '2019-01-01 00:00:00'],
        ['name' => 'Sally', 'deleted_at' => '2019-01-02 00:00:00'],
    ]
*/


/******************************************
 * whereStrict()
 * このメソッドの使用法は、whereメソッドと同じです。
 *
 * 値の比較はすべて「厳格」な比較で行われます。
 *  ******************************************/

/******************************************
 * whereBetween()
 * whereBetweenメソッドは、指定したアイテム値が、指定範囲内にあるかどうかを判断する
 * コレクションをフィルタリングします。
 *  ******************************************/


$collection = collect([
    ['product' => 'Desk', 'price' => 200],
    ['product' => 'Chair', 'price' => 80],
    ['product' => 'Bookcase', 'price' => 150],
    ['product' => 'Pencil', 'price' => 30],
    ['product' => 'Door', 'price' => 100],
]);

$filtered = $collection->whereBetween('price', [100, 200]);

$filtered->all();

/*
    [
        ['product' => 'Desk', 'price' => 200],
        ['product' => 'Bookcase', 'price' => 150],
        ['product' => 'Door', 'price' => 100],
    ]
*/

/******************************************
 * whereIn()
 * whereInメソッドは、指定配列中のアイテム値を持たない要素をコレクションから削除します。
 *
 *
 * whereInメソッドはアイテム値のチェックを「緩く」比較します。
 * つまり同じ値の文字列と整数値は同値と判定します。
 *
 * 「厳密」な比較でフィルタリングしたい場合は、whereInStrictメソッドを使ってください。
 *  ******************************************/


$collection = collect([
    ['product' => 'Desk', 'price' => 200],
    ['product' => 'Chair', 'price' => 100],
    ['product' => 'Bookcase', 'price' => 150],
    ['product' => 'Door', 'price' => 100],
]);

$filtered = $collection->whereIn('price', [150, 200]);

$filtered->all();

/*
    [
        ['product' => 'Desk', 'price' => 200],
        ['product' => 'Bookcase', 'price' => 150],
    ]
*/




/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * メソッド定義
 *
 ******************************************/
/*
|--------------------------------------------------------------------------
| 基本の設定
|--------------------------------------------------------------------------
|
|
*/



/******************************************
 * メソッド定義
 *
 ******************************************/